gif-api/app/controllers/collections_controller.rb

  def index
    @collections = Collection.all
---
SELECT "collections".* FROM "collections" ORDER BY "collections"."updated_at" DESC

  def create
    @collection = Collection.new(collection_params)
    @user = User.find_or_create_by(user_params)

    @collection.user = @user

    if @collection.save && @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Brian"], ["created_at", "2021-05-11 21:01:28.510097"], ["updated_at", "2021-05-11 21:01:28.510097"]]
INSERT INTO "collections" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "My First Collection"], ["created_at", "2021-05-11 21:31:58.540931"], ["updated_at", "2021-05-11 21:31:58.540931"], ["user_id", 1]]

  def update
    if @collection.update(collection_params)
---
UPDATE "collections" SET "updated_at" = $1, "likes" = $2 WHERE "collections"."id" = $3  [["updated_at", "2021-05-20 18:26:11.780555"], ["likes", 2], ["id", 54]]

  def destroy
    @collection.destroy
---
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 39]]

    def set_collection
      @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 39], ["LIMIT", 1]]