gif-api/app/controllers/gifs_controller.rb

  def index
    @gifs = Gif.all
---
SELECT "gifs".* FROM "gifs"

  def create
    @gif = Gif.new(gif_params)

    if @gif.save
---
INSERT INTO "gifs" ("collection_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["collection_id", 9], ["created_at", "2021-05-07 16:49:37.357999"], ["updated_at", "2021-05-07 16:49:37.357999"]]

  def destroy
    @gif.destroy
---
DELETE FROM "gifs" WHERE "gifs"."id" = $1  [["id", 26]]

    def set_gif
      @gif = Gif.find(params[:id])
---
SELECT "gifs".* FROM "gifs" WHERE "gifs"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]